In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import pickle

In [11]:
data=pd.read_csv('/Users/malloryhightower/Desktop/Flask/dataset.csv')

In [12]:
data.head()

,Index,Experience,test_score,interview_score,Salary,Unnamed: 5,Unnamed: 6
0,0,1,10,9,50000,NaN,NaN
1,1,5,7,7,40000,NaN,NaN
2,2,2,7,6,32000,NaN,NaN
3,3,13,5,3,199000,NaN,NaN
4,4,15,5,5,92000,NaN,NaN

In [13]:
data=data.drop(['Unnamed: 5', 'Unnamed: 6','Index'], axis=1)
data

   Experience  test_score  interview_score  Salary
0           1          10                9   50000
1           5           7                7   40000
2           2           7                6   32000
3          13           5                3  199000
4          15           5                5   92000
5          30           1               10   65000
6           6           9                4   98000

In [23]:
X = data.iloc[:, :3]
y = data.iloc[:, 3]

In [24]:
X

   Experience  test_score  interview_score
0           1          10                9
1           5           7                7
2           2           7                6
3          13           5                3
4          15           5                5
5          30           1               10
6           6           9                4

In [26]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()

#Fitting model with trainig data
regressor.fit(X, y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [27]:
# Saving model to disk
pickle.dump(regressor, open('model.pkl','wb'))

In [31]:
# Loading model to compare the results
model = pickle.load(open('model.pkl','rb'))
print(model.predict([[1,10,9]]))

[17956.94851417]